## Saving dataset from Datacamp

In [ ]:
salaries.to_csv("salaries.csv", index=False)

In [ ]:
iron_2_actors.to_csv("iron_2_actors.csv", index=False)

In [ ]:
with open("iron_2_actors.csv", "r") as file:
    print(file.read())

In [ ]:
genres.to_csv("genres.csv", index=False)

In [ ]:
with open("genres.csv", "r") as file:
    print(file.read())

In [ ]:
non_mus_tcks.to_csv("non_mus_tcks.csv", index=False)

In [ ]:
with open("non_mus_tcks.csv", "r") as file:
    print(file.read())

In [ ]:
top_invoices.to_csv("top_invoices.csv", index=False)

In [ ]:
with open("top_invoices.csv", "r") as file:
    print(file.read())

## Importing packages

In [76]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from jupyter_datatables import init_datatables_mode
from ydata_profiling import ProfileReport

In [80]:
from scipy.stats import binom
from scipy.stats import uniform
from scipy.stats import norm
from scipy.stats import poisson

profile = ProfileReport(spotify_mysterious_sample2, title="Data Profile", explorative=True)
profile.to_notebook_iframe()

!pip show jupyter_datatables jupyter_require

from jupyter_require import require
require.config({
    'paths': {
        'd3': 'https://d3js.org/d3.v5.min',
        'd3-array': 'https://d3js.org/d3-array.v2.min'
    }
})

## Using .select_dtypes()

In [3]:
import pandas as pd
import numpy as np

# Create a sample DataFrame with various data types
data = {
    'ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan'],
    'Age': [25, 30, 22, 28, 35],
    'Height': [5.5, 6.0, 5.7, 5.8, 6.1],
    'Weight': [55.2, 78.5, 60.0, 62.3, 80.1],
    'Is_Student': [True, False, True, False, False],
    'Gender': ['F', 'M', 'M', 'F', 'M'],
    'Enrollment_Date': pd.to_datetime(['2023-01-01', '2022-09-15', '2021-06-10', '2020-11-20', '2023-03-03']),
    'Score': [np.nan, 88.5, 92.3, np.nan, 85.0],
    'Remarks': [None, 'Excellent', 'Good', 'Average', 'Excellent']
}

df = pd.DataFrame(data)

print("Full DataFrame:")
df

Full DataFrame:

,ID,Name,Age,Height,Weight,Is_Student,Gender,Enrollment_Date,Score,Remarks
0,101,Alice,25,5.5,55.2,True,F,2023-01-01,NaN,None
1,102,Bob,30,6.0,78.5,False,M,2022-09-15,88.5,Excellent
2,103,Charlie,22,5.7,60.0,True,M,2021-06-10,92.3,Good
3,104,Diana,28,5.8,62.3,False,F,2020-11-20,NaN,Average
4,105,Ethan,35,6.1,80.1,False,M,2023-03-03,85.0,Excellent

In [7]:
# Select only numeric columns (int and float)
numeric_df = df.select_dtypes(include='number')
print("\nNumeric Columns:")
numeric_df

Numeric Columns:

    ID  Age  Height  Weight  Score
0  101   25     5.5    55.2    NaN
1  102   30     6.0    78.5   88.5
2  103   22     5.7    60.0   92.3
3  104   28     5.8    62.3    NaN
4  105   35     6.1    80.1   85.0

In [9]:
# Select only object (string-like) columns
object_df = df.select_dtypes(include='object')
print("\nObject (string-like) Columns:")
object_df

Object (string-like) Columns:

      Name Gender    Remarks
0    Alice      F       None
1      Bob      M  Excellent
2  Charlie      M       Good
3    Diana      F    Average
4    Ethan      M  Excellent

In [11]:
# Select boolean columns
bool_df = df.select_dtypes(include='bool')
print("\nBoolean Columns:")
bool_df

Boolean Columns:

   Is_Student
0        True
1       False
2        True
3       False
4       False

In [13]:
# Select datetime columns
datetime_df = df.select_dtypes(include='datetime')
print("\nDatetime Columns:")
datetime_df

Datetime Columns:

  Enrollment_Date
0      2023-01-01
1      2022-09-15
2      2021-06-10
3      2020-11-20
4      2023-03-03

In [15]:
selected_df = df.select_dtypes(include=['number', 'bool'])
selected_df

    ID  Age  Height  Weight  Is_Student  Score
0  101   25     5.5    55.2        True    NaN
1  102   30     6.0    78.5       False   88.5
2  103   22     5.7    60.0        True   92.3
3  104   28     5.8    62.3       False    NaN
4  105   35     6.1    80.1       False   85.0

## Using np.select()

In [19]:
import pandas as pd
import numpy as np

# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan'],
    'Age': [25, 17, 34, 15, 45]
})

df

      Name  Age
0    Alice   25
1      Bob   17
2  Charlie   34
3    Diana   15
4    Ethan   45

In [21]:
# Define conditions
conditions = [
    df['Age'] < 18,
    (df['Age'] >= 18) & (df['Age'] < 30),
    df['Age'] >= 30
]

# Define choices for each condition
choices = ['Teenager', 'Young Adult', 'Adult']

# Apply np.select
df['Age_Group'] = np.select(conditions, choices, default='Unknown')

df

      Name  Age    Age_Group
0    Alice   25  Young Adult
1      Bob   17     Teenager
2  Charlie   34        Adult
3    Diana   15     Teenager
4    Ethan   45        Adult

## Using np.where()

In [26]:
import pandas as pd
import numpy as np

# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan'],
    'Score': [85, 40, 67, 90, 55]
})

df

      Name  Score
0    Alice     85
1      Bob     40
2  Charlie     67
3    Diana     90
4    Ethan     55

In [28]:
# Apply np.where: If score >= 60, then 'Pass', else 'Fail'
df['Result'] = np.where(df['Score'] >= 60, 'Pass', 'Fail')

print(df)

      Name  Score Result
0    Alice     85   Pass
1      Bob     40   Fail
2  Charlie     67   Pass
3    Diana     90   Pass
4    Ethan     55   Fail

## Using .map()

In [31]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan'],
    'Gender': ['F', 'M', 'M', 'F', 'M']
})

df

      Name Gender
0    Alice      F
1      Bob      M
2  Charlie      M
3    Diana      F
4    Ethan      M

In [33]:
# Map shorthand gender to full form
gender_map = {'M': 'Male', 'F': 'Female'}
df['Gender_Full'] = df['Gender'].map(gender_map)

print(df)

      Name Gender Gender_Full
0    Alice      F      Female
1      Bob      M        Male
2  Charlie      M        Male
3    Diana      F      Female
4    Ethan      M        Male

## Using .query()

In [38]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan'],
    'Age': [25, 17, 34, 15, 45],
    'Gender': ['F', 'M', 'M', 'F', 'M'],
    'Score': [85, 40, 67, 90, 55]
})

df

      Name  Age Gender  Score
0    Alice   25      F     85
1      Bob   17      M     40
2  Charlie   34      M     67
3    Diana   15      F     90
4    Ethan   45      M     55

In [40]:
# Use .query() to filter rows where Age >= 18 and Score > 60
adults_with_high_scores = df.query('Age >= 18 and Score > 60')

print(adults_with_high_scores)

      Name  Age Gender  Score
0    Alice   25      F     85
2  Charlie   34      M     67

In [44]:
df.query('`Name` == "Bob"')

  Name  Age Gender  Score
1  Bob   17      M     40

## .query() with in and not in

In [67]:
import pandas as pd

# Sample DataFrame
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan'],
    'Department': ['HR', 'Sales', 'IT', 'HR', 'Finance'],
    'Salary': [50000, 60000, 70000, 52000, 75000]
})

df

      Name Department  Salary
0    Alice         HR   50000
1      Bob      Sales   60000
2  Charlie         IT   70000
3    Diana         HR   52000
4    Ethan    Finance   75000

In [69]:
# Define a list of departments
target_departments = ['HR', 'IT']

# Use query with @ to refer to external variable
in_result = df.query('Department in @target_departments')
not_in_result = df.query('Department not in @target_departments')

print("Employees in HR or IT:")
in_result

Employees in HR or IT:

      Name Department  Salary
0    Alice         HR   50000
2  Charlie         IT   70000
3    Diana         HR   52000

In [71]:
print("\nEmployees NOT in HR or IT:")
not_in_result

Employees NOT in HR or IT:

    Name Department  Salary
1    Bob      Sales   60000
4  Ethan    Finance   75000

## Using reset_index()

In [59]:
import pandas as pd

# Sample DataFrame with custom index
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Age': [25, 30, 22, 28]
}, index=['a', 'b', 'c', 'd'])

df

      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   22
d    Diana   28

In [61]:
# Reset the index and rename columns
df_reset = df.reset_index()
df_reset

  index     Name  Age
0     a    Alice   25
1     b      Bob   30
2     c  Charlie   22
3     d    Diana   28

In [63]:
# Rename columns after reset_index
df_reset.rename(columns={'index': 'Custom_Index', 'Name': 'Full_Name', 'Age': 'Age_Years'}, inplace=True)

print("DataFrame after reset_index() and renaming columns:")
df_reset

DataFrame after reset_index() and renaming columns:

  Custom_Index Full_Name  Age_Years
0            a     Alice         25
1            b       Bob         30
2            c   Charlie         22
3            d     Diana         28

In [65]:
# Reset the index and drop the old index column
df_reset_drop = df.reset_index(drop=True)

print("\nDataFrame after reset_index(drop=True):")
df_reset_drop

DataFrame after reset_index(drop=True):

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    Diana   28

## Using .cat_categories()

In [38]:
import pandas as pd

# Create a DataFrame with a categorical column
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'JobRole': pd.Categorical(['Engineer', 'Manager', 'Engineer', 'Clerk'])
})

df

      Name   JobRole
0    Alice  Engineer
1      Bob   Manager
2  Charlie  Engineer
3    David     Clerk

In [40]:
df['JobRole'].cat.categories

Index(['Clerk', 'Engineer', 'Manager'], dtype='object')

In [42]:
filtered_df = df[df['JobRole'] == 'Engineer']
filtered_df

      Name   JobRole
0    Alice  Engineer
2  Charlie  Engineer

In [44]:
filtered_df['JobRole'].cat.categories

Index(['Clerk', 'Engineer', 'Manager'], dtype='object')

Even though only `"Engineer"` is used, `"Clerk"` and `"Manager"` are still listed as categories — they're unused.

In [50]:
filtered_df.loc[:,'JobRole'] = filtered_df['JobRole'].cat.remove_unused_categories().astype('object')
filtered_df['JobRole'].cat.categories

Index(['Engineer'], dtype='object')

Now the JobRole column only contains the categories that actually exist in the filtered data.

In [52]:
filtered_df = filtered_df.copy()

In [54]:
filtered_df.loc['JobRole'] = filtered_df['JobRole'].cat.remove_unused_categories()
filtered_df['JobRole'].cat.categories

Index(['Engineer'], dtype='object')

In [21]:
import pandas as pd

# Original data with 5 rows
attrition_pop = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve']
})

attrition_pop

  Employee
0    Alice
1      Bob
2  Charlie
3    David
4      Eve

In [23]:
shuffled = attrition_pop.sample(frac=1, replace=False)
shuffled

  Employee
0    Alice
2  Charlie
4      Eve
1      Bob
3    David

In [25]:
resampled = attrition_pop.sample(frac=1, replace=True)
resampled

  Employee
4      Eve
1      Bob
4      Eve
4      Eve
0    Alice

In [ ]:

spotify_sample.to_csv("spotify_sample.csv", index=False)

with open("spotify_sample.csv", "r") as file:
    print(file.read())

In [ ]:
import pandas as pd
import numpy as np

# Assuming np_cont is a NumPy array of continents (as in your original code)
# Convert it to a pandas Series
continent_series = pd.Series(np_cont)

# Create a color mapping dictionary (as in your original code)
col_dict = {
    'Asia': 'red',
    'Europe': 'green',
    'Africa': 'blue',
    'Americas': 'yellow',
    'Oceania': 'black'
}

# Use .map() to create the color list
col = continent_series.map(col_dict).tolist()

# Now 'col' contains the list of colors corresponding to each continent
# You can use 'col' in your scatter plot

Does going to university in a different country affect your mental health? A Japanese international university surveyed its students in 2018 and published a study the following year that was approved by several ethical and regulatory boards.

The study found that international students have a higher risk of mental health difficulties than the general population, and that social connectedness (belonging to a social group) and acculturative stress (stress associated with joining a new culture) are predictive of depression.

Explore the students data using PostgreSQL to find out if you would come to a similar conclusion for international students and see if the length of stay is a contributing factor.

Here is a data description of the columns you may find helpful.

# Analyze the Impact of Length of Stay on Mental Health Scores

Explore and analyze the students' data to see how the length of stay (`stay`) impacts the average mental health diagnostic scores of the international students present in the study.

## Instructions

1. **Objective**: Return a table with nine rows and five columns.
2. **Column Aliases**:
   - `stay`: Represents the length of stay.
   - `count_int`: Count of international students for each length of stay.
   - `average_phq`: Average of the `todep` (PHQ-9 test) scores, rounded to two decimal places.
   - `average_scs`: Average of the `tosc` (SCS test) scores, rounded to two decimal places.
   - `average_as`: Average of the `toas` (ASISS test) scores, rounded to two decimal places.
3. **Details**:
   - The average columns (`average_phq`, `average_scs`, `average_as`) should contain the averages of the respective columns (`todep`, `tosc`, `toas`) for each length of stay.
   - Use the `count_int` column to store the number of international students for each length of stay.
4. **Sorting**:
   - Sort the table by `stay` in descending order.

## Implementation Notes

- Make sure to create a DataFrame that matches the above schema with the final name `df`.
- Ensure that creating new cells in the notebook does not rename the DataFrame.

In [ ]:
FROM left_table
JOIN right_table
ON left_table.key = right_table.key

In [8]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'A': [1, -1, 3],
    'B': [-2, 4, -6]
})

df.style.map(lambda x: 'color: red' if x < 0 else 'color: green')

In [14]:
df.style.background_gradient(cmap='viridis')

In [22]:
df.style.background_gradient(cmap='coolwarm')

In [20]:
df.style.highlight_max(color='green').highlight_min(color='red')